NOTE_MAP = {
    # dict[str,int]
    'C': 0,
    'D': 2,
    'E': 4,
    'F': 5,
    'G': 7,
    'A': 9,
    'B': 11,
    }

PITCH_MAP = {
    # dict[int,str]
    0: 'C',
    1: 'C#',
    2: 'D',
    3: 'D#',
    4: 'E',
    5: 'F',
    6: 'F#',
    7: 'G',
    8: 'G#',
    9: 'A',
    10: 'A#',
    11: 'B',
    }

SHIFT_MAP = {
    # 关于增减有一些麻烦，尚且有些bug
    '': 0,  # 还原记号或无升降记号
    'b': -1,
    '#': 1,
    'P': 0,  # 纯
    'M': 0,  # 大
    'm': -1,  # 小
    'd': -1,  # 减
    'A': +1,  # 增
    }

DEGREE_MAP = {
    # 音的度数
    # 如9度 9/7=1...2，即等效2度音
    # numerical name 度数
    # 以自然大调为基准
    '1P': 0,  # 纯一度
    '2m': 1,  # 小二度
    '2M': 2,  # 大二度
    '3m': 3,  # 小三度
    '3M': 4,  # 大三度
    '4P': 5,  # 纯四度
    '4A': 6,  # 增四度
    '5d': 6,  # 减五度
    '5P': 7,  # 纯五度
    '6m': 8,  # 小六度
    '5A': 8,  # 增五度
    '6M': 9,  # 大六度
    '7d': 9,  # 大六度
    '7m': 10,  # 小七度
    '7M': 11,  # 大七度
    '8P': 12,  # 纯八度
    '9m': 13,  # 小九度（小二度）
    '8A': 13,  # 增八度
    '9M': 14,  # 大九度（大二度）
    '9A': 15,  # 增九度（增二度）
    '10m': 15,  # 小十度（小三度）
    '10M': 16,  # 大十度（大三度）
    '11P': 17,  # 纯十一度（纯四度）
    '11A': 18,  # 增十一度（增四度）
    '12d': 18,  # 减十二度（减五度）
    '12P': 19,  # 纯十二度（纯五度）
    '13m': 20,  # 小十三度（小六度）
    '13M': 21,  # 大十三度（大六度）
    '14m': 22,  # 小十四度（小七度）
    '14M': 23,  # 大十四度（大七度）
    }

INTERVAL_MAP = {
    # 音程数
    0: ['1P'],  # 纯一度
    1: ['2m', '9m'],  # 小二度（小九度）
    2: ['2M', '9M'],  # 大二度（大九度）
    3: ['3m', '10m'],  # 小三度（小十度）
    4: ['3M', '10M'],  # 大三度（大十度）
    5: ['4P'],  # 纯四度
    6: ['4A', '5d'],  # 增四度/减五度
    7: ['5P'],  # 纯五度
    8: ['6m', '5A', '13m'],  # 小六度（小十三度）/增五度
    9: ['6M', '7d', '13M'],  # 大六度（大十三度）
    10: ['7m', '14m'],  # 小七度（小十四度）
    11: ['7M', '14M'],  # 大七度（大十四度）
    12: ['8P', '1P'],  # 纯八度（纯一度）
    13: ['9m', '8A', '2m'],  # 小九度（小二度）/增八度
    14: ['9M', '2M'],  # 大九度（大二度）
    15: ['10m', '9A', '3m'],  # 小十度（小三度）/增九度（增二度）
    16: ['10M', '3M'],  # 大十度（大三度）
    17: ['11P', '4P'],  # 纯十一度（纯四度）
    18: ['11A', '12d', '4A', '5d'],  # 增十一度（增四度）/减十二度（减五度）
    19: ['12P', '5P'],  # 纯十二度（纯五度）
    20: ['13m', '6m'],  # 小十三度（小六度）
    21: ['13M', '6M'],  # 大十三度（大六度）
    22: ['14m', '7m'],  # 小十四度（小七度）
    23: ['14M', '7M'],  # 大十四度（大七度）
    }

DEFAULT_OCT = 5
